import fs from 'fs';

const courtNames = `ศาลฎีกา
ศาลอุทธรณ์
ศาลอุทธรณ์คดีชำนัญพิเศษ 
ศาลอุทธรณ์ภาค 1 (ปทุมธานี)
ศาลอุทธรณ์ภาค 2 (ระยอง)
ศาลอุทธรณ์ภาค 3 (นครราชสีมา)
ศาลอุทธรณ์ภาค 4 (ขอนแก่น)
ศาลอุทธรณ์ภาค 5 (เชียงใหม่)
ศาลอุทธรณ์ภาค 6 (นครสวรรค์)
ศาลอุทธรณ์ภาค 7 (นครปฐม)
ศาลอุทธรณ์ภาค 8 (ภูเก็ต)
ศาลอุทธรณ์ภาค 9 (สงขลา)
ศาลอาญา
ศาลอาญากรุงเทพใต้
ศาลอาญาธนบุรี
ศาลแพ่ง
ศาลแพ่งกรุงเทพใต้
ศาลแพ่งธนบุรี
ศาลแพ่งตลิ่งชัน
ศาลอาญาตลิ่งชัน
ศาลแพ่งพระโขนง
ศาลอาญาพระโขนง
ศาลแพ่งมีนบุรี
ศาลอาญามีนบุรี
ศาลทรัพย์สินทางปัญญาฯ
ศาลภาษีอากรกลาง
ศาลล้มละลายกลาง
ศาลเยาวชนและครอบครัวกลาง
ศาลเยาวชนและครอบครัวกลาง (สาขามีนบุรี)
ศาลแรงงานกลาง (กรุงเทพฯ)
ศาลแรงงานภาค 1 (สระบุรี)
ศาลแรงงานภาค 2 (ชลบุรี)
ศาลแรงงานภาค 3 (นครราชสีมา)
ศาลแรงงานภาค 4 (อุดรธานี)
ศาลแรงงานภาค 5 (เชียงใหม่)
ศาลแรงงานภาค 6 (นครสวรรค์)
ศาลแรงงานภาค 7 (กาญจนบุรี)
ศาลแรงงานภาค 8 (ภูเก็ต)
ศาลแรงงานภาค 9 (สงขลา)
ศาลอาญาคดีทุจริตและประพฤติมิชอบกลาง (กรุงเทพฯ)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 1 (สระบุรี)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 2 (ระยอง)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 3 (สุรินทร์)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 4 (ขอนแก่น)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 5 (เชียงใหม่)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 6 (พิษณุโลก)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 7 (สมุทรสงคราม)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 8 (นครศรีธรรมราช)
ศาลอาญาคดีทุจริตและประพฤติมิชอบภาค 9 (สงขลา)
ศาลแขวงดอนเมือง
ศาลแขวงดุสิต
ศาลแขวงธนบุรี
ศาลแขวงปทุมวัน
ศาลแขวงพระนครเหนือ
ศาลแขวงพระนครใต้
ศาลแขวงบางบอน
ศาลแขวงนนทบุรี
ศาลแขวงพระนครศรีอยุธยา
ศาลแขวงลพบุรี
ศาลแขวงสระบุรี
ศาลแขวงสมุทรปราการ
ศาลจังหวัดชัยนาท
ศาลจังหวัดนนทบุรี
ศาลจังหวัดปทุมธานี
ศาลจังหวัดธัญบุรี
ศาลจังหวัดพระนครศรีอยุธยา
ศาลจังหวัดลพบุรี
ศาลจังหวัดชัยบาดาล
ศาลจังหวัดสมุทรปราการ
ศาลจังหวัดสระบุรี
ศาลจังหวัดสิงห์บุรี
ศาลจังหวัดอ่างทอง
ศาลเยาวชนและครอบครัวจังหวัดชัยนาท
ศาลเยาวชนและครอบครัวจังหวัดนนทบุรี
ศาลเยาวชนและครอบครัวจังหวัดปทุมธานี
ศาลเยาวชนและครอบครัวจังหวัดพระนครศรีอยุธยา
ศาลเยาวชนและครอบครัวจังหวัดลพบุรี
ศาลเยาวชนและครอบครัวจังหวัดสมุทรปราการ
ศาลเยาวชนและครอบครัวจังหวัดสระบุรี 
ศาลเยาวชนและครอบครัวจังหวัดสิงห์บุรี 
ศาลเยาวชนและครอบครัวจังหวัดอ่างทอง
ศาลแขวงชลบุรี
ศาลแขวงพัทยา
ศาลแขวงระยอง
ศาลจังหวัดปราจีนบุรี
ศาลจังหวัดกบินทร์บุรี
ศาลจังหวัดจันทบุรี
ศาลจังหวัดฉะเชิงเทรา
ศาลจังหวัดชลบุรี
ศาลจังหวัดพัทยา
ศาลจังหวัดตราด
ศาลจังหวัดนครนายก
ศาลจังหวัดระยอง
ศาลจังหวัดสระแก้ว
ศาลเยาวชนและครอบครัวจังหวัดจันทบุรี
ศาลเยาวชนและครอบครัวจังหวัดฉะเชิงเทรา
ศาลเยาวชนและครอบครัวจังหวัดชลบุรี
ศาลเยาวชนและครอบครัวจังหวัดตราด
ศาลเยาวชนและครอบครัวจังหวัดนครนายก
ศาลเยาวชนและครอบครัวจังหวัดปราจีนบุรี
ศาลเยาวชนและครอบครัวจังหวัดระยอง
ศาลเยาวชนและครอบครัวจังหวัดสระแก้ว
สำนักศาลยุติธรรมประจำภาค 2 (ชลบุรี)
ศาลแขวงนครราชสีมา
ศาลแขวงสุรินทร์
ศาลแขวงอุบลราชธานี
ศาลจังหวัดชัยภูมิ
ศาลจังหวัดภูเขียว
ศาลจังหวัดนครราชสีมา
ศาลจังหวัดสีคิ้ว
ศาลจังหวัดสีคิ้ว (สาขาปากช่อง)
ศาลจังหวัดบัวใหญ่
ศาลจังหวัดพิมาย
ศาลจังหวัดบุรีรัมย์
ศาลจังหวัดนางรอง
ศาลจังหวัดยโสธร
ศาลจังหวัดศรีสะเกษ
ศาลจังหวัดกันทรลักษ์
ศาลจังหวัดสุรินทร์
ศาลจังหวัดรัตนบุรี
ศาลจังหวัดอำนาจเจริญ
ศาลจังหวัดอุบลราชธานี
ศาลจังหวัดเดชอุดม
ศาลเยาวชนและครอบครัวจังหวัดชัยภูมิ
ศาลเยาวชนและครอบครัวจังหวัดนครราชสีมา
ศาลเยาวชนและครอบครัวจังหวัดบุรีรัมย์
ศาลเยาวชนและครอบครัวจังหวัดยโสธร
ศาลเยาวชนและครอบครัวจังหวัดศรีสะเกษ
ศาลเยาวชนและครอบครัวจังหวัดสุรินทร์
ศาลเยาวชนและครอบครัวจังหวัดอำนาจเจริญ
ศาลเยาวชนและครอบครัวจังหวัดอุบลราชธานี
ศาลแขวงขอนแก่น
ศาลแขวงอุดรธานี
ศาลแขวงพยัคฆภูมิพิสัย
ศาลจังหวัดกาฬสินธุ์
ศาลจังหวัดขอนแก่น
ศาลจังหวัดพล
ศาลจังหวัดชุมแพ
ศาลจังหวัดนครพนม
ศาลจังหวัดบึงกาฬ
ศาลจังหวัดมหาสารคาม
ศาลจังหวัดมุกดาหาร
ศาลจังหวัดร้อยเอ็ด
ศาลจังหวัดเลย
ศาลจังหวัดสกลนคร
ศาลจังหวัดสว่างแดนดิน
ศาลจังหวัดหนองคาย
ศาลจังหวัดหนองบัวลำภู
ศาลจังหวัดอุดรธานี
ศาลเยาวชนและครอบครัวจังหวัดกาฬสินธุ์
ศาลเยาวชนและครอบครัวจังหวัดขอนแก่น
ศาลเยาวชนและครอบครัวจังหวัดนครพนม
ศาลเยาวชนและครอบครัวจังหวัดบึงกาฬ
ศาลเยาวชนและครอบครัวจังหวัดมหาสารคาม
ศาลเยาวชนและครอบครัวจังหวัดมุกดาหาร
ศาลเยาวชนและครอบครัวจังหวัดร้อยเอ็ด
ศาลเยาวชนและครอบครัวจังหวัดเลย
ศาลเยาวชนและครอบครัวจังหวัดสกลนคร
ศาลเยาวชนและครอบครัวจังหวัดหนองคาย
ศาลเยาวชนและครอบครัวจังหวัดหนองบัวลำภู
ศาลเยาวชนและครอบครัวจังหวัดอุดรธานี
สำนักศาลยุติธรรมประจำภาค 4 (ขอนแก่น)
ศาลแขวงเชียงใหม่
ศาลแขวงลำปาง
ศาลแขวงเวียงป่าเป้า
ศาลแขวงเชียงราย
ศาลแขวงเชียงดาว
ศาลจังหวัดเชียงราย
ศาลจังหวัดเทิง
ศาลจังหวัดเชียงใหม่
ศาลจังหวัดฮอด
ศาลจังหวัดฝาง
ศาลจังหวัดน่าน
ศาลจังหวัดพะเยา
ศาลจังหวัดเชียงคำ
ศาลจังหวัดแพร่
ศาลจังหวัดแม่ฮ่องสอน
ศาลจังหวัดแม่สะเรียง
ศาลจังหวัดลำปาง
ศาลจังหวัดลำพูน
ศาลเยาวชนและครอบครัวจังหวัดเชียงราย
ศาลเยาวชนและครอบครัวจังหวัดเชียงใหม่
ศาลเยาวชนและครอบครัวจังหวัดน่าน
ศาลเยาวชนและครอบครัวจังหวัดพะเยา
ศาลเยาวชนและครอบครัวจังหวัดแพร่
ศาลเยาวชนและครอบครัวจังหวัดแม่ฮ่องสอน
ศาลเยาวชนและครอบครัวจังหวัดลำปาง
ศาลเยาวชนและครอบครัวจังหวัดลำพูน
ศาลแขวงนครสวรรค์
ศาลแขวงพิษณุโลก
ศาลแขวงนครไทย
ศาลจังหวัดกำแพงเพชร
ศาลจังหวัดตาก
ศาลจังหวัดแม่สอด
ศาลจังหวัดนครสวรรค์
ศาลจังหวัดพิจิตร
ศาลจังหวัดพิษณุโลก
ศาลจังหวัดเพชรบูรณ์
ศาลจังหวัดวิเชียรบุรี
ศาลจังหวัดหล่มสัก
ศาลจังหวัดสุโขทัย
ศาลจังหวัดสวรรคโลก
ศาลจังหวัดอุตรดิตถ์
ศาลจังหวัดอุทัยธานี
ศาลเยาวชนและครอบครัวจังหวัดกำแพงเพชร
ศาลเยาวชนและครอบครัวจังหวัดตาก
ศาลเยาวชนและครอบครัวจังหวัดนครสวรรค์
ศาลเยาวชนและครอบครัวจังหวัดพิจิตร
ศาลเยาวชนและครอบครัวจังหวัดพิษณุโลก
ศาลเยาวชนและครอบครัวจังหวัดเพชรบูรณ์
ศาลเยาวชนและครอบครัวจังหวัดสุโขทัย
ศาลเยาวชนและครอบครัวจังหวัดอุตรดิตถ์
ศาลเยาวชนและครอบครัวจังหวัดอุทัยธานี
ศาลแขวงนครปฐม
ศาลแขวงราชบุรี
ศาลแขวงสุพรรณบุรี
ศาลจังหวัดกาญจนบุรี
ศาลจังหวัดทองผาภูมิ
ศาลจังหวัดนครปฐม
ศาลจังหวัดประจวบคีรีขันธ์
ศาลจังหวัดหัวหิน
ศาลจังหวัดเพชรบุรี
ศาลจังหวัดราชบุรี
ศาลจังหวัดสมุทรสงคราม
ศาลจังหวัดสมุทรสาคร
ศาลจังหวัดสุพรรณบุรี
ศาลเยาวชนและครอบครัวจังหวัดกาญจนบุรี
ศาลเยาวชนและครอบครัวจังหวัดนครปฐม
ศาลเยาวชนและครอบครัวจังหวัดประจวบคีรีขันธ์
ศาลเยาวชนและครอบครัวจังหวัดเพชรบุรี
ศาลเยาวชนและครอบครัวจังหวัดราชบุรี
ศาลเยาวชนและครอบครัวจังหวัดสมุทรสงคราม
ศาลเยาวชนและครอบครัวจังหวัดสมุทรสาคร
ศาลเยาวชนและครอบครัวจังหวัดสุพรรณบุรี
ศาลแขวงนครศรีธรรมราช
ศาลแขวงสุราษฎร์ธานี
ศาลแขวงทุ่งสง
ศาลแขวงกระบี่
ศาลจังหวัดกระบี่
ศาลจังหวัดชุมพร
ศาลจังหวัดหลังสวน
ศาลจังหวัดนครศรีธรรมราช
ศาลจังหวัดทุ่งสง
ศาลจังหวัดปากพนัง
ศาลจังหวัดพังงา
ศาลจังหวัดตะกั่วป่า
ศาลแขวงภูเก็ต
ศาลจังหวัดภูเก็ต
ศาลจังหวัดระนอง
ศาลจังหวัดสุราษฎร์ธานี
ศาลจังหวัดเกาะสมุย
ศาลจังหวัดไชยา
ศาลจังหวัดเวียงสระ
ศาลเยาวชนและครอบครัวจังหวัดกระบี่
ศาลเยาวชนและครอบครัวจังหวัดชุมพร
ศาลเยาวชนและครอบครัวจังหวัดนครศรีธรรมราช
ศาลเยาวชนและครอบครัวจังหวัดภูเก็ต
ศาลเยาวชนและครอบครัวจังหวัดระนอง
ศาลเยาวชนและครอบครัวจังหวัดสุราษฎร์ธานี
ศาลเยาวชนและครอบครัวจังหวัดพังงา
ศาลแขวงสงขลา
ศาลแขวงตรัง
ศาลจังหวัดตรัง
ศาลจังหวัดนราธิวาส
ศาลจังหวัดปัตตานี
ศาลจังหวัดพัทลุง
ศาลจังหวัดยะลา
ศาลจังหวัดเบตง
ศาลจังหวัดสงขลา
ศาลจังหวัดนาทวี
ศาลจังหวัดสตูล
ศาลเยาวชนและครอบครัวจังหวัดตรัง
ศาลเยาวชนและครอบครัวจังหวัดนราธิวาส
ศาลเยาวชนและครอบครัวจังหวัดปัตตานี
ศาลเยาวชนและครอบครัวจังหวัดพัทลุง
ศาลเยาวชนและครอบครัวจังหวัดยะลา
ศาลเยาวชนและครอบครัวจังหวัดสงขลา
ศาลเยาวชนและครอบครัวจังหวัดสตูล`;

let sql = `insert into court_names  (name, created_by, updated_by)
values
`;

courtNames.split('\n').map(courtName => {
    sql += `('${courtName}', 1, 1),\n`;
});

console.log(sql)

fs.writeFileSync('./court-name.sql', sql);